// 1. 
// let x = 1;
// let y = 2;
// let res1 ="" + x + y;
// console.log(res1);
// console.log(typeof(res1));

// let res2 = Boolean(x) + String(y);
// console.log(res2); 
// console.log(typeof res2);

// let a =3;
// let res3 = x+y===a;
// console.log(res3);
// console.log(typeof res3);

// let res4 = x+y+undefined;
// console.log(res4); 
// console.log(typeof res4);

// Допишіть код, щоб в консолі браузера з'явилися рядки, які написані в коментарях, оперуючи при цьому змінними х і у.






// 2. Користувач вводить число (використовуйте prompt ()). Необхідно перевірити чи є введене число
// 	a) парним додатним;
// 	b) кратним числу 7.
// Результат перевірки вивести в консоль.

// let num = +prompt("Введіть будь-яке число:");

// if (num > 0 && num % 2 === 0) {
//     console.log("Число є парним і додатним.");
// } else {
//     console.log("Число не є парним і додатним.");
// }

// if (num % 7 === 0) {
//     console.log("Число кратне 7.");
// } else {
//     console.log("Число НЕ кратне 7.");
// }



// 3. Створіть порожній масив;
// 1) У перший елемент масиву запишіть будь-яке число;
// 2) У другий елемент масиву запишіть будь-який рядок;
// 3) У третій елемент масиву запишіть будь-яке логічне значення;
// 4) У четвертий елемент масиву запишіть значення null;
// 5) Виведіть на екран число елементів, яке зберігається в масиві;
// 6) Запитайте у користувача ввести будь-яке значення і запишіть це значення в п'ятий елемент масиву;
// 7) Виведіть на екран п'ятий елемент масиву.
// 8) Видаліть 1-ий елемент масиву і виведіть масив на екран.

// let arr =[];
// arr[0]= 5;
// arr[1] ="apple";
// arr[2] = true;
// arr[3]= null;
// console.log(arr.length);
// arr[4] = prompt("Введіть будь-яке значення для 5-го елемента:");
// console.log(arr[4]);
// arr.shift;
// console.log(arr);



// 4. Напишіть програму, яка об’єднує всі наявні елементи масиву в стрічку і розділяє їх символом “*”.
// Початковий масив:
// let cities = ["Rome", "Lviv", "Warsaw"]; 
// Результат:
// "Rome*Lviv*Warsaw"

// let cities = ["Rome", "Lviv", "Warsaw"];
// let result = cities.join("*");
// console.log(result);

// 5. Використовуючи функцію prompt() задайте користувачу питання про досягнення ним повнолітнього віку. Результат запишіть в змінну isAdult. В залежності від отриманого значення виведіть відповідне повідомлення про статус особи. Наприклад: при виконанні умови вік більше 18 вивести “Ви досягли повнолітнього віку”. Якщо вік менше 18 років вивести “Ви ще надто молоді”, 

// let isAdult = prompt("Скільки вам років?");
// isAdult = Number(isAdult);
// if (isAdult >= 18) {
//   console.log("Ви досягли повнолітнього віку");
// } else if (isAdult > 0) {
//   console.log("Ви ще надто молоді");
// } else {
//   console.log("Некоректне значення віку");
// }



// 6. Користувач вводить три довжини сторін трикутника (використовуйте prompt () три рази для введення кожної сторони).
// Необхідно 
// 	a) визначити і вивести в консоль площу трикутника 
// 	b) перевірити чи цей трикутник є прямокутним і вивести в консоль результат перевірки.
// Здійснювати перевірку чи введені користувачем значення коректні, в іншому випадку вивести 'Incorrect data‘. Результат обчислення площі трикутника виводити в консоль з точністю 3 знаки після коми (наприклад:  8.42355465 =>  8.424).  

// let a = +prompt("Введіть сторону a:");
// let b = +prompt("Введіть сторону b:");
// let c = +prompt("Введіть сторону c:");

// if (isNaN(a) || isNaN(b) || isNaN(c) || a <= 0 || b <= 0 || c <= 0) {
//     console.log("Incorrect data");
// } else if (a + b <= c || a + c <= b || b + c <= a)  {
//     console.log("Incorrect data");
// } else {
//     let p = (a + b + c) / 2;
//     let area = Math.sqrt(p * (p - a) * (p - b) * (p - c));
//     console.log("Площа трикутника:", area.toFixed(3));
// }

// if (a ** 2 === b ** 2 + c ** 2 || 
//     b ** 2 === a ** 2 + c ** 2 || 
//     c ** 2 === a ** 2 + b ** 2) {
//     console.log("Це прямокутний трикутник.");
// } else {
//     console.log("Це НЕ прямокутний трикутник.");
// }





// 7. Написати умовну конструкцію, яка в залежності від часу доби виводитиме відповідне привітання. Потрібно отримати реальний час доби із системи. Зробити 2 способами через 2 різних умовних оператора.
// В діапазоні годин 23-5 – має виводитися привітання “Доброї ночі”
// В діапазоні годин 5-11 – має виводитися привітання “Доброго ранку”
// В діапазоні годин 11-17 – має виводитися привітання “Доброго дня”
// В діапазоні годин 17-23 – має виводитися привітання “Доброго вечора”.